package ArrayList;

public class ArrayListTest {

    /*
    배열의 단점과 ArrayList
    - 배열은 프로그램에서 사용 하려면 항상 배열 길이를 정하고 시작한다.
    - 예를 들어 100명의 학생을 위한 프로그램을 개발했는데  어느 날 전학 온학생으로 100명이 넘었다
      배열을 사용하는 중에는 길이를 변경할 수 없기 때문에 코드를 수정해야 한다
    - 중간에 학생 한 명이 전학을 갔다 배열은 중간에 비어 있는 요소를 둘 수 없기 때문에 배열 요소 위치를 변경해야 한다
    - 두 경우 모두 배열을 수정해야 하는 문제가 발생한다

    -ArrayList 주요 메소드
    1.boolean add(E e): 요소 하나를 배열에 추가한다 E는 요소의 자료형을 의미한다
    2.int size(): 배열에 추가된 요소 전체 개수를 반환한다.
    3.E get(int index): 배열의 index 위치에 있는 요소 값을 반환한다
    4.E remove(int index): 배열의 index 위치에 있는 요소 값을 제거하고 그 값을 반환한다
    5.boolean isEmpty(): 배열이 비어 있는지 확인한다.
     */
}
